In [1]:
import pandas as pd
students_data = pd.read_csv('data/students_performance.csv', sep=',')
students_data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [2]:
students_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [4]:
students_data.loc[155, 'writing score']

88

In [5]:
students_data.describe(include='object')

,gender,race/ethnicity,parental level of education,lunch,test preparation course
count,1000,1000,1000,1000,1000
unique,2,5,6,2,2
top,female,group C,some college,standard,none
freq,518,319,226,645,642

In [6]:
students_data.describe().loc[:,['math score']]

       math score
count  1000.00000
mean     66.08900
std      15.16308
min       0.00000
25%      57.00000
50%      66.00000
75%      77.00000
max     100.00000

In [7]:
students_data['math score'].mean()

66.089

In [8]:
students_data['race/ethnicity'].mode()

0    group C
Name: race/ethnicity, dtype: object

In [9]:
students_data.head(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88

In [11]:
round(students_data[students_data['test preparation course'] == 'completed']['reading score'].mean())

74

In [18]:
students_data[students_data['math score'] == 0].shape[0]

1

In [20]:
students_data.head(6)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78

In [23]:
paid_food = students_data[students_data['lunch'] == 'standard']['math score'].mean()
not_paid_food = students_data[students_data['lunch'] == 'free/reduced']['math score'].mean()
paid_food, not_paid_food, paid_food > not_paid_food

(70.03410852713178, 58.92112676056338, True)

In [28]:
students_data['parental level of education'] == "bachelor's degree"

0       True
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: parental level of education, Length: 1000, dtype: bool

In [31]:
round(students_data['parental level of education'].value_counts(normalize=True) * 100)

some college          23.0
associate's degree    22.0
high school           20.0
some high school      18.0
bachelor's degree     12.0
master's degree        6.0
Name: parental level of education, dtype: float64

In [32]:
students_data.head(6)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78

In [33]:
median_group_A = students_data[students_data['race/ethnicity'] == 'group A']['writing score'].median()
mean_grouc_C = students_data[students_data['race/ethnicity'] == 'group C']['writing score'].mean()
abs(round(median_group_A - mean_grouc_C))

6